### Análise de dados Titanic
Basedo no estudo do Minerando Dados
link -> https://minerandodados.com.br/analise-de-dados-com-python-usando-pandas/

In [1]:
# Importando as bibliotecas

import pandas as pd

In [2]:
# Fazendo a leitura do arquivo 
df = pd.read_csv("titanic.csv")
# Analisando as cinco primeiras linhas
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# Analisando as cinco últimas linhas do DataFrame
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
# Mostra uma linha aleatória do DataFrame
df.sample()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
201,202,0,3,"Sage, Mr. Frederick",male,NaN,8,2,CA. 2343,69.55,NaN,S

In [5]:
# Analisando o tipo de dados no DataFrame de cada coluna, bem como o número de linhas
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
# Tipo de dados do DataFrame
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
# Verifica a quantidade de linhas e colunas
df.shape

(891, 12)

In [8]:
# Uma análise descritiva do DataFrame
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
# A biblioteca Pandas permite criar de forma automática o índice sequencial do DataFrame, por meio do index
df.index

RangeIndex(start=0, stop=891, step=1)

In [10]:
# Para configurar o índice usamos o parâmetro set_index e informamos qual coluna será utilizada
# A coluna PassengerId deixará de ser uma coluna e será o nosso índice do DataFrame
df.set_index('PassengerId', inplace=True)
df.head(12)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [11]:
# Retorna o nome das colunas
df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
# Retorna um array numpy (matrizes multi-dimensionais) com os valores contidos no DataFrame
df.values

array([[0, 3, 'Braund, Mr. Owen Harris', ..., 7.25, nan, 'S'],
       [1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', ...,
        71.2833, 'C85', 'C'],
       [1, 3, 'Heikkinen, Miss. Laina', ..., 7.925, nan, 'S'],
       ...,
       [0, 3, 'Johnston, Miss. Catherine Helen "Carrie"', ..., 23.45,
        nan, 'S'],
       [1, 1, 'Behr, Mr. Karl Howell', ..., 30.0, 'C148', 'C'],
       [0, 3, 'Dooley, Mr. Patrick', ..., 7.75, nan, 'Q']], dtype=object)

In [15]:
# Por meio do método loc podemos selecionar um subconjunto do DataFrame através do índice. No exemplo a coluna PassengerID
# passou a ser o nosso índice do DataFrame
df.loc[891]

Survived                      0
Pclass                        3
Name        Dooley, Mr. Patrick
Sex                        male
Age                          32
SibSp                         0
Parch                         0
Ticket                   370376
Fare                       7.75
Cabin                       NaN
Embarked                      Q
Name: 891, dtype: object

In [16]:
# Podemos fazer o fatiamento do DataFrame usando o método loc
df.loc[1:10,['Name','Sex', 'Age']]

                                                          Name     Sex   Age
PassengerId
1                                      Braund, Mr. Owen Harris    male  22.0
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
3                                       Heikkinen, Miss. Laina  female  26.0
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
5                                     Allen, Mr. William Henry    male  35.0
6                                             Moran, Mr. James    male   NaN
7                                      McCarthy, Mr. Timothy J    male  54.0
8                               Palsson, Master. Gosta Leonard    male   2.0
9            Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
10                         Nasser, Mrs. Nicholas (Adele Achem)  female  14.0

In [18]:
# Contagem por Sexo
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [20]:
# Número de sobreviventes
df['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [38]:
# Quantas pessoas sobreviveram
sobreviventes = df['Survived'].value_counts()
print('Total de passageiros:', df['Survived'].count())
print('Quantidade de sobreviventes: ', sobreviventes[1])

Total de passageiros: 891
Quantidade de sobreviventes:  342

In [39]:
# Quantas pessoas morreram
mortos = df['Survived'].value_counts()
print('Total de passageiros:', df['Survived'].count())
print('Quantidade de mortos: ', mortos[0])

Total de passageiros: 891
Quantidade de mortos:  549

In [23]:
# Eliminar NaN da coluna Age
df_subconjunto = df[df['Age'] != 'Nan'].copy()

In [27]:
# Média de idade dos passageiros
df_subconjunto['Age'].mean()

29.69911764705882

In [31]:
# Subconjunto dos homens
df_male = df[df['Sex'] == 'male'].copy()

In [32]:
df_male.mean()

Survived     0.188908
Pclass       2.389948
Age         30.726645
SibSp        0.429809
Parch        0.235702
Fare        25.523893
dtype: float64

In [34]:
# Subconjunto das mulheres
df_female = df[df['Sex'] == 'female'].copy()

In [35]:
df_female.mean()

Survived     0.742038
Pclass       2.159236
Age         27.915709
SibSp        0.694268
Parch        0.649682
Fare        44.479818
dtype: float64

In [36]:
# Cidade de embarque
# S - Southampton
# C - Cherbourg
# Q - Queenstown

df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64